# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "cask"
brew 'mas'				#cask는 webpage에서 설치,mas는 app store에서 설치

cask "iterm2"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "svn"                            # for some font needed svn.
brew "fish"
brew "starship"

# fonts #################################################################################
cask "font-righteous" 
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'

cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-hack-nerd-font"

cask "font-d2coding"
cask "font-nanum-gothic"
cask "font-nanum-gothic-coding"

cask "font-meslo-lg-nerd-font"
cask "font-meslo-for-powerline"

cask "font-iosevka-nerd-font"
cask "font-noto-nerd-font"

cask "font-ubuntu-nerd-font"
cask "font-powerline-symbols"

# Binaries

brew "imagemagick"
brew 'awscli'
brew 'coreutils'			#possible gnu
brew "bat" 			        # modern cat
brew 'gh'
brew "gnupg"
brew 'grep'
brew 'httpie'                           #terminal에서 사용하는 postman으로 보면됨.
brew 'hub'
brew 'mackup'
brew 'cmake'
brew 'libtool'
brew 'tree'
brew 'zlib'
brew "neofetch"				#neofetch는 terminal대문 애플로고
brew "curl"

brew "youtube-dl"                       # Youtube Download Cli
brew "asciinema"	                # Terminal Record

# Development

brew "mysql"
brew "redis"
brew "yarn"

#cask "emacs"
brew "djvulibre"
#brew "fontforge"
brew "isync"
brew "mu"

brew "node"
brew "sbcl"
brew "pyenv"

brew "swi-prolog"
brew "wget"


# cloud apps

cask "google-drive"
cask "icloud-control"
cask "dropbox"

# epps
cask "karabiner-elements"
cask "skype"
cask "google-chrome"
cask "firefox"
cask "firefox-developer-edition"
cask "aerial"
cask "caffeine"
cask "discord"
cask "docker"
cask "github"
cask "mpv"
cask "gpg-suite"
cask "skitch"
cask "screenflow"
cask "zoom"
cask "the-unarchiver"
cask "slack"
cask "transmission"
cask "tableplus"
cask "bitwarden"
cask "app-cleaner"

# Multimedia ###########################################################
cask "vox"                                            # 오디오 플레이어
cask "iina"

# mas apps (app store)
# mas "Xcode", id: 497799835
#mas "KakaoTalk", id: 869223134
#mas "Hangul Office",id:416746898
#mas "Easy Res", id: 688211836
